app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-01-16 23:07:45.768209"], ["updated_at", "2016-01-16 23:07:45.768209"]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 2]]